{
  "backend/main.mo": "Motoko canister defining authorization-gated CRUD for members, payments, check-ins, and user profiles with persistent state and admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented app features to source files, components, and requirements.",
  "frontend-file-summaries.txt": "JSON-style list of concise summaries for all frontend files used in the app.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, and routes for all main pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user attempts to access a restricted page.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with state handling and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to submit initial profile data and save it to the backend.",
  "frontend/src/components/layout/AppShell.tsx": "Main authenticated layout with navigation, header/footer, and admin‑aware menu rendering.",
  "frontend/src/components/members/AttendancePanel.tsx": "Displays a member's attendance stats and history, with admin-only check-in actions and last-30-days metrics.",
  "frontend/src/components/members/MemberFormDialog.tsx": "Dialog form for creating or editing a member, handling controlled inputs and submit mutations.",
  "frontend/src/components/members/MembershipEditor.tsx": "Shows membership plan and dates for a member, with a notice that full membership features are pending.",
  "frontend/src/components/members/PaymentsPanel.tsx": "Shows a member's payment history and lets admins record new payments via a dialog form.",
  "frontend/src/components/members/ProfilePanel.tsx": "Displays core profile info for a member and allows admins to open an edit dialog.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAttendance.ts": "Provides hooks to fetch member check-ins and perform check-in mutations with query invalidation.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the caller's user profile, role, and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, and logout via Dfinity AuthClient.",
  "frontend/src/hooks/useMembers.ts": "React Query hooks for fetching, creating, and updating members through the backend actor.",
  "frontend/src/hooks/usePayments.ts": "React Query hooks for retrieving and adding member payments via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains a simple wrapper hook to fetch all member data using React Query.",
  "frontend/src/index.css": "Tailwind CSS base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React root, wraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ClassesPage.tsx": "UI page placeholder for future class scheduling features with static informational content.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying member statistics and recent activity using fetched member data.",
  "frontend/src/pages/MemberDetailPage.tsx": "Shows detailed member info with tabs for profile, membership, payments, and attendance.",
  "frontend/src/pages/MembersPage.tsx": "Lists, searches, and manages members with admin-only creation and navigation to member details.",
  "frontend/src/pages/PlansPage.tsx": "Placeholder page for upcoming membership plan management features.",
  "frontend/src/pages/SettingsPage.tsx": "Admin-only page allowing role assignment and principal-to-member linking using canister mutations, with form validation and success/error alerts.",
  "frontend/src/pages/SignedOutLanding.tsx": "Public landing page with branding, hero sections, feature highlights, and Internet Identity sign-in handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, container settings, and plugin setup.",
  "project_state.json": "Project metadata describing features, requirements, state version, and required images for the gym management app."
}